In [1]:
import pandas as pd
import sqlite3

In [2]:
# Conectamos con la base de datos chinook.db
connection = sqlite3.connect("data/chinook.db")

# Obtenemos un cursor que utilizaremos para hacer las queries
crsr = connection.cursor()

In [3]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [5]:
# #Otra forma de ver la informacion completa de la tablar
# query = pragma table_info(tabla)
# sql_query(query)

In [6]:
#Ejercicio 1 

query = '''
SELECT * 
FROM customers 
WHERE Country LIKE 'Brazil'

'''

sql_query(query)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,+55 (11) 3033-4564,eduardo@woodstock.com.br,4
2,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,+55 (11) 3055-8131,alero@uol.com.br,5
3,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,+55 (21) 2271-7070,roberto.almeida@riotur.gov.br,3
4,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,+55 (61) 3363-7855,fernadaramos4@uol.com.br,4

In [7]:
#Ejercicio 2

query = '''
SELECT * 
FROM employees
WHERE Title LIKE 'Sales Support Agent'

'''

sql_query(query)

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,3,Peacock,Jane,Sales Support Agent,2,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
1,4,Park,Margaret,Sales Support Agent,2,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
2,5,Johnson,Steve,Sales Support Agent,2,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [8]:
#Ejercicio 3

query = '''
SELECT * 
FROM tracks
WHERE Composer LIKE 'AC/DC'

'''

sql_query(query)

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,15,Go Down,4,1,1,AC/DC,331180,10847611,0.99
1,16,Dog Eat Dog,4,1,1,AC/DC,215196,7032162,0.99
2,17,Let There Be Rock,4,1,1,AC/DC,366654,12021261,0.99
3,18,Bad Boy Boogie,4,1,1,AC/DC,267728,8776140,0.99
4,19,Problem Child,4,1,1,AC/DC,325041,10617116,0.99
5,20,Overdose,4,1,1,AC/DC,369319,12066294,0.99
6,21,Hell Ain't A Bad Place To Be,4,1,1,AC/DC,254380,8331286,0.99
7,22,Whole Lotta Rosie,4,1,1,AC/DC,323761,10547154,0.99

In [9]:
#Ejercicio 4

query = '''
SELECT CustomerId, FirstName, LastName, Country
FROM customers
WHERE NOT Country = 'USA'

'''

sql_query(query)

    CustomerId  FirstName      LastName         Country
0            1       Luís     Gonçalves          Brazil
1            2     Leonie        Köhler         Germany
2            3   François      Tremblay          Canada
3            4      Bjørn        Hansen          Norway
4            5  František   Wichterlová  Czech Republic
5            6     Helena          Holý  Czech Republic
6            7     Astrid        Gruber         Austria
7            8       Daan       Peeters         Belgium
8            9       Kara       Nielsen         Denmark
9           10    Eduardo       Martins          Brazil
10          11  Alexandre         Rocha          Brazil
11          12    Roberto       Almeida          Brazil
12          13   Fernanda         Ramos          Brazil
13          14       Mark       Philips          Canada
14          15   Jennifer      Peterson          Canada
15          29     Robert         Brown          Canada
16          30     Edward       Francis          Canada
17          31     Martha          Silk          Canada
18          32      Aaron      Mitchell          Canada
19          33      Ellie      Sullivan          Canada
20          34       João     Fernandes        Portugal
21          35   Madalena       Sampaio        Portugal
22          36     Hannah     Schneider         Germany
23          37       Fynn    Zimmermann         Germany
24          38     Niklas      Schröder         Germany
25          39    Camille       Bernard          France
26          40  Dominique      Lefebvre          France
27          41       Marc        Dubois          France
28          42      Wyatt        Girard          France
29          43   Isabelle       Mercier          France
30          44      Terhi    Hämäläinen         Finland
31          45   Ladislav        Kovács         Hungary
32          46       Hugh      O'Reilly         Ireland
33          47      Lucas       Mancini           Italy
34          48   Johannes  Van der Berg     Netherlands
35          49  Stanisław        Wójcik          Poland
36          50    Enrique         Muñoz           Spain
37          51     Joakim     Johansson          Sweden
38          52       Emma         Jones  United Kingdom
39          53       Phil        Hughes  United Kingdom
40          54      Steve        Murray  United Kingdom
41          55       Mark        Taylor       Australia
42          56      Diego     Gutiérrez       Argentina
43          57       Luis         Rojas           Chile
44          58      Manoj        Pareek           India
45          59       Puja    Srivastava           India

In [10]:
#Ejercicio 5

query = '''
SELECT FirstName, LastName, Email, Address, City, State, Country
FROM employees
WHERE Title LIKE 'Sales Support Agent'


'''

sql_query(query)

,FirstName,LastName,Email,Address,City,State,Country
0,Jane,Peacock,jane@chinookcorp.com,1111 6 Ave SW,Calgary,AB,Canada
1,Margaret,Park,margaret@chinookcorp.com,683 10 Street SW,Calgary,AB,Canada
2,Steve,Johnson,steve@chinookcorp.com,7727B 41 Ave,Calgary,AB,Canada

In [11]:
#Ejercicio 6

query = '''
SELECT DISTINCT billingcountry
FROM Invoices
'''

sql_query(query)

    BillingCountry
0          Germany
1           Norway
2          Belgium
3           Canada
4              USA
5           France
6          Ireland
7   United Kingdom
8        Australia
9            Chile
10           India
11          Brazil
12        Portugal
13     Netherlands
14           Spain
15          Sweden
16  Czech Republic
17         Finland
18         Denmark
19           Italy
20          Poland
21         Austria
22         Hungary
23       Argentina

In [12]:
#Ejercicio 7

query = '''
SELECT DISTINCT STATE
FROM customers
where country LIKE 'USA'
'''

sql_query(query)

   State
0     CA
1     WA
2     NY
3     NV
4     FL
5     MA
6     IL
7     WI
8     TX
9     AZ
10    UT

In [13]:
#Ejercicio 8

query = '''
SELECT DISTINCT count(trackid)
FROM invoice_items
where invoiceid LIKE 37
'''

sql_query(query)

   count(trackid)
0               4

In [14]:
#Ejercicio 8

query = '''
SELECT sum(quantity)
FROM invoice_items
where invoiceid LIKE 37
'''

sql_query(query)

   sum(quantity)
0              4

In [15]:
#Ejercicio 9

query = '''
SELECT distinct count(trackid)
FROM tracks
WHERE composer LIKE 'AC/DC'
'''

sql_query(query)

   count(trackid)
0               8

In [16]:
#Ejercicio 10

query = '''
SELECT DISTINCT invoiceid, sum(quantity) as Total_items
FROM invoice_items
group by invoiceid

'''

sql_query(query)

     InvoiceId  Total_items
0            1            2
1            2            4
2            3            6
3            4            9
4            5           14
..         ...          ...
407        408            4
408        409            6
409        410            9
410        411           14
411        412            1

[412 rows x 2 columns]

In [17]:
#Ejercicio 11

query = '''
SELECT DISTINCT BillingCountry, count(invoiceid) as Count_invoices
FROM invoices
group by BillingCountry

'''

sql_query(query)

    BillingCountry  Count_invoices
0        Argentina               7
1        Australia               7
2          Austria               7
3          Belgium               7
4           Brazil              35
5           Canada              56
6            Chile               7
7   Czech Republic              14
8          Denmark               7
9          Finland               7
10          France              35
11         Germany              28
12         Hungary               7
13           India              13
14         Ireland               7
15           Italy               7
16     Netherlands               7
17          Norway               7
18          Poland               7
19        Portugal              14
20           Spain               7
21          Sweden               7
22             USA              91
23  United Kingdom              21

In [18]:




query = '''
SELECT *
FROM invoices


'''

sql_query(query)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,None,Norway,0171,3.96
2,3,8,2009-01-03 00:00:00,Grétrystraat 63,Brussels,None,Belgium,1000,5.94
3,4,14,2009-01-06 00:00:00,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
4,5,23,2009-01-11 00:00:00,69 Salem Street,Boston,MA,USA,2113,13.86
...,...,...,...,...,...,...,...,...,...
407,408,25,2013-12-05 00:00:00,319 N. Frances Street,Madison,WI,USA,53703,3.96
408,409,29,2013-12-06 00:00:00,796 Dundas Street West,Toronto,ON,Canada,M6J 1V1,5.94
409,410,35,2013-12-09 00:00:00,"Rua dos Campeões Europeus de Viena, 4350",Porto,None,Portugal,None,8.91
410,411,44,2013-12-14 00:00:00,Porthaninkatu 9,Helsinki,None,Finland,00530,13.86
411,412,58,2013-12-22 00:00:00,"12,Community Centre",Delhi,None,India,110017,1.99

In [19]:
#Ejercicio 12

query = '''
SELECT count(invoiceid) as Count_invoices
FROM invoices
WHERE strftime('%Y', invoicedate) = '2009' or strftime('%Y', invoicedate) like '2011'

'''

sql_query(query)

   Count_invoices
0             166

In [20]:

#Ejercicio 13

query = '''
SELECT count(invoiceid) as Count_invoices
FROM invoices
WHERE strftime('%Y', invoicedate) between '2009' and '2011'

'''

sql_query(query)

   Count_invoices
0             249

In [21]:

#Ejercicio 14

query = '''
SELECT count(customerid)
FROM customers
WHERE country like 'spain' or country like 'Brazil'

'''

sql_query(query)

   count(customerid)
0                  6

In [22]:
#Ejercicio 15

query = '''
SELECT *
FROM tracks
WHERE name like 'You%'

'''

sql_query(query)

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,39,You Oughta Know,6,1,1,Alanis Morissette & Glenn Ballard,249234,8196916,0.99
1,44,You Learn,6,1,1,Alanis Morissette & Glenn Ballard,239699,7824837,0.99
2,50,You Oughta Know (Alternate),6,1,1,Alanis Morissette & Glenn Ballard,491885,16008629,0.99
3,99,Your Time Has Come,11,1,4,"Cornell, Commerford, Morello, Wilk",255529,8273592,0.99
4,337,You Shook Me,30,1,1,J B Lenoir/Willie Dixon,315951,10249958,0.99
5,349,You Shook Me(2),30,1,1,J B Lenoir/Willie Dixon,619467,20138673,0.99
6,549,You Fool No One,43,1,1,Coverdale/Lord/Paice,804101,26369966,0.99
7,623,You Fool No One (Alternate Version),50,1,1,Blackmore/Coverdale/Lord/Paice,763924,24887209,0.99
8,753,You Keep On Moving,58,1,1,Coverdale/Hughes,319111,10447868,0.99
9,812,You Can't Do it Right (With the One You Love),65,1,1,D.Coverdale/G.Hughes/Glenn Hughes/R.Blackmore/...,203755,6709579,0.99
10,1155,You're Crazy,90,2,1,None,197135,3301971,0.99
11,1163,You Ain't the First,91,2,1,None,156268,2754414,0.99
12,1185,You Could Be Mine,92,1,3,Izzy Stradlin'/W. Axl Rose,343875,11207355,0.99
13,1553,You've Got Another Thing Comin',125,1,3,None,305162,9962558,0.99
14,1620,You Shook Me,132,1,1,J. B. Lenoir/Willie Dixon,388179,12643067,0.99
15,1622,Your Time Is Gonna Come,132,1,1,Jimmy Page/John Paul Jones,274860,9011653,0.99
16,1776,You've Been A Long Time Coming,146,1,14,Brian Holland/Eddie Holland/Lamont Dozier,137221,4437949,0.99
17,1778,You're What's Happening (In The World Today),146,1,14,Allen Story/George Gordy/Robert Gordy,142027,4631104,0.99
18,1787,You Sure Love To Ball,146,1,14,Marvin Gaye,218540,7217872,0.99
19,2127,Your Blue Room,176,1,10,"Brian Eno, Bono, Adam Clayton, The Edge & Larr...",328228,10867860,0.99
20,2185,You Are,180,1,1,Matt Cameron,270863,8938409,0.99
21,2259,You're My Best Friend,185,1,1,"Deacon, John",172225,5602173,0.99
22,2287,You Are The Everything,188,1,4,Bill Berry-Peter Buck-Mike Mills-Michael Stipe,226298,7373181,0.99
23,2439,You've Got It,141,1,1,Mick Hucknall and Lamont Dozier,235232,7712845,0.99
24,2444,Your Mirror,141,1,1,Mick Hucknall,240666,7893821,0.99
25,2677,You Got Me Rocking,217,1,1,Jagger/Richards,205766,6734385,0.99
26,2691,You Got Me Rocking,218,1,1,Jagger/Richards,215928,7162159,0.99
27,2750,You Better You Bet,221,1,1,Pete Townshend,338520,11160877,0.99
28,3083,You Really Got Me,244,1,1,Ray Davies,158589,5194092,0.99
29,3113,You Got No Right,246,1,1,"Dave Kushner, Duff, Matt Sorum, Scott Weiland ...",335412,10991094,0.99
30,3141,You're Gonna Break My Hart Again,141,1,3,Sykes,250853,8176847,0.99
31,3225,Your Time Is Gonna Come,252,2,1,"Page, Jones",310774,5126563,0.99
32,3372,Your Savior,269,2,23,None,244226,4199626,0.99
33,3384,Your Soul Today,270,2,23,Chris Cornell,205959,3385722,0.99
34,3388,You Know My Name,270,2,23,Chris Cornell,240255,3940651,0.99
35,3456,You Know I'm No Good,321,2,14,None,256946,4133694,0.99
36,3465,You Know I'm No Good (feat. Ghostface Killah),321,2,14,None,202320,3260658,0.99
37,3468,You Sent Me Flying / Cherry,322,2,9,None,409906,6657517,0.99

# SEGUNDA PARTE

In [23]:
# 1. Facturas de Clientes de Brasil, Nombre del cliente, Id de factura, fecha de la factura y el país de la factura

query = '''
SELECT  cus.FirstName, cus.LastName, i.invoiceid, i.invoicedate,i.billingcountry
FROM invoices as i
LEFT JOIN customers as cus
on i.customerid = cus.customerid
WHERE billingcountry = 'Brazil'

'''

sql_query(query)

    FirstName   LastName  InvoiceId          InvoiceDate BillingCountry
0     Eduardo    Martins         25  2009-04-09 00:00:00         Brazil
1     Roberto    Almeida         34  2009-05-23 00:00:00         Brazil
2    Fernanda      Ramos         35  2009-06-05 00:00:00         Brazil
3   Alexandre      Rocha         57  2009-09-06 00:00:00         Brazil
4    Fernanda      Ramos         58  2009-09-07 00:00:00         Brazil
5   Alexandre      Rocha         68  2009-10-17 00:00:00         Brazil
6    Fernanda      Ramos         80  2009-12-10 00:00:00         Brazil
7        Luís  Gonçalves         98  2010-03-11 00:00:00         Brazil
8        Luís  Gonçalves        121  2010-06-13 00:00:00         Brazil
9   Alexandre      Rocha        123  2010-06-17 00:00:00         Brazil
10   Fernanda      Ramos        132  2010-07-31 00:00:00         Brazil
11       Luís  Gonçalves        143  2010-09-15 00:00:00         Brazil
12    Eduardo    Martins        154  2010-11-14 00:00:00         Brazil
13    Roberto    Almeida        155  2010-11-14 00:00:00         Brazil
14    Roberto    Almeida        166  2010-12-25 00:00:00         Brazil
15    Eduardo    Martins        177  2011-02-16 00:00:00         Brazil
16       Luís  Gonçalves        195  2011-05-06 00:00:00         Brazil
17    Eduardo    Martins        199  2011-05-21 00:00:00         Brazil
18    Roberto    Almeida        221  2011-08-25 00:00:00         Brazil
19    Eduardo    Martins        251  2012-01-09 00:00:00         Brazil
20  Alexandre      Rocha        252  2012-01-22 00:00:00         Brazil
21   Fernanda      Ramos        253  2012-01-22 00:00:00         Brazil
22   Fernanda      Ramos        264  2012-03-03 00:00:00         Brazil
23  Alexandre      Rocha        275  2012-04-25 00:00:00         Brazil
24  Alexandre      Rocha        297  2012-07-28 00:00:00         Brazil
25       Luís  Gonçalves        316  2012-10-27 00:00:00         Brazil
26   Fernanda      Ramos        319  2012-11-01 00:00:00         Brazil
27       Luís  Gonçalves        327  2012-12-07 00:00:00         Brazil
28  Alexandre      Rocha        349  2013-03-18 00:00:00         Brazil
29    Roberto    Almeida        350  2013-03-31 00:00:00         Brazil
30    Eduardo    Martins        372  2013-07-02 00:00:00         Brazil
31    Roberto    Almeida        373  2013-07-03 00:00:00         Brazil
32       Luís  Gonçalves        382  2013-08-07 00:00:00         Brazil
33    Eduardo    Martins        383  2013-08-12 00:00:00         Brazil
34    Roberto    Almeida        395  2013-10-05 00:00:00         Brazil

In [24]:
query = '''
SELECT *
FROM  employees

'''

sql_query(query)

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com
5,6,Mitchell,Michael,IT Manager,1.0,1973-07-01 00:00:00,2003-10-17 00:00:00,5827 Bowness Road NW,Calgary,AB,Canada,T3B 0C5,+1 (403) 246-9887,+1 (403) 246-9899,michael@chinookcorp.com
6,7,King,Robert,IT Staff,6.0,1970-05-29 00:00:00,2004-01-02 00:00:00,590 Columbia Boulevard West,Lethbridge,AB,Canada,T1K 5N8,+1 (403) 456-9986,+1 (403) 456-8485,robert@chinookcorp.com
7,8,Callahan,Laura,IT Staff,6.0,1968-01-09 00:00:00,2004-03-04 00:00:00,923 7 ST NW,Lethbridge,AB,Canada,T1H 1Y8,+1 (403) 467-3351,+1 (403) 467-8772,laura@chinookcorp.com

In [25]:
# 2. Obtén cada factura asociada a cada agente de ventas con su nombre completo

query = '''
SELECT  i.invoiceid, e.firstname, e.lastname
FROM invoices as i
LEFT JOIN customers as cus
on i.customerid = cus.customerid
LEFT JOIN employees as e
on cus.SupportRepId = e.EmployeeId

'''

sql_query(query)

     InvoiceId FirstName LastName
0           98      Jane  Peacock
1          121      Jane  Peacock
2          143      Jane  Peacock
3          195      Jane  Peacock
4          316      Jane  Peacock
..         ...       ...      ...
407         45      Jane  Peacock
408         97      Jane  Peacock
409        218      Jane  Peacock
410        229      Jane  Peacock
411        284      Jane  Peacock

[412 rows x 3 columns]

In [26]:
# 3. Obtén el nombre del cliente, el país, el nombre del agente y el total

query = '''
SELECT  cus.firstname, cus.lastname,cus.company,cus.country, e.firstname as rep_name, e.lastname as rep_lastname
from customers as cus
LEFT JOIN employees as e
on cus.SupportRepId = e.EmployeeId

'''

sql_query(query)

,FirstName,LastName,Company,Country,rep_name,rep_lastname
0,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,Brazil,Jane,Peacock
1,Leonie,Köhler,None,Germany,Steve,Johnson
2,François,Tremblay,None,Canada,Jane,Peacock
3,Bjørn,Hansen,None,Norway,Margaret,Park
4,František,Wichterlová,JetBrains s.r.o.,Czech Republic,Margaret,Park
5,Helena,Holý,None,Czech Republic,Steve,Johnson
6,Astrid,Gruber,None,Austria,Steve,Johnson
7,Daan,Peeters,None,Belgium,Margaret,Park
8,Kara,Nielsen,None,Denmark,Margaret,Park
9,Eduardo,Martins,Woodstock Discos,Brazil,Margaret,Park
10,Alexandre,Rocha,Banco do Brasil S.A.,Brazil,Steve,Johnson
11,Roberto,Almeida,Riotur,Brazil,Jane,Peacock
12,Fernanda,Ramos,None,Brazil,Margaret,Park
13,Mark,Philips,Telus,Canada,Steve,Johnson
14,Jennifer,Peterson,Rogers Canada,Canada,Jane,Peacock
15,Frank,Harris,Google Inc.,USA,Margaret,Park
16,Jack,Smith,Microsoft Corporation,USA,Steve,Johnson
17,Michelle,Brooks,None,USA,Jane,Peacock
18,Tim,Goyer,Apple Inc.,USA,Jane,Peacock
19,Dan,Miller,None,USA,Margaret,Park
20,Kathy,Chase,None,USA,Steve,Johnson
21,Heather,Leacock,None,USA,Margaret,Park
22,John,Gordon,None,USA,Margaret,Park
23,Frank,Ralston,None,USA,Jane,Peacock
24,Victor,Stevens,None,USA,Steve,Johnson
25,Richard,Cunningham,None,USA,Margaret,Park
26,Patrick,Gray,None,USA,Margaret,Park
27,Julia,Barnett,None,USA,Steve,Johnson
28,Robert,Brown,None,Canada,Jane,Peacock
29,Edward,Francis,None,Canada,Jane,Peacock
30,Martha,Silk,None,Canada,Steve,Johnson
31,Aaron,Mitchell,None,Canada,Margaret,Park
32,Ellie,Sullivan,None,Canada,Jane,Peacock
33,João,Fernandes,None,Portugal,Margaret,Park
34,Madalena,Sampaio,None,Portugal,Margaret,Park
35,Hannah,Schneider,None,Germany,Steve,Johnson
36,Fynn,Zimmermann,None,Germany,Jane,Peacock
37,Niklas,Schröder,None,Germany,Jane,Peacock
38,Camille,Bernard,None,France,Margaret,Park
39,Dominique,Lefebvre,None,France,Margaret,Park
40,Marc,Dubois,None,France,Steve,Johnson
41,Wyatt,Girard,None,France,Jane,Peacock
42,Isabelle,Mercier,None,France,Jane,Peacock
43,Terhi,Hämäläinen,None,Finland,Jane,Peacock
44,Ladislav,Kovács,None,Hungary,Jane,Peacock
45,Hugh,O'Reilly,None,Ireland,Jane,Peacock
46,Lucas,Mancini,None,Italy,Steve,Johnson
47,Johannes,Van der Berg,None,Netherlands,Steve,Johnson
48,Stanisław,Wójcik,None,Poland,Margaret,Park
49,Enrique,Muñoz,None,Spain,Steve,Johnson
50,Joakim,Johansson,None,Sweden,Steve,Johnson
51,Emma,Jones,None,United Kingdom,Jane,Peacock
52,Phil,Hughes,None,United Kingdom,Jane,Peacock
53,Steve,Murray,None,United Kingdom,Steve,Johnson
54,Mark,Taylor,None,Australia,Margaret,Park
55,Diego,Gutiérrez,None,Argentina,Margaret,Park
56,Luis,Rojas,None,Chile,Steve,Johnson
57,Manoj,Pareek,None,India,Jane,Peacock
58,Puja,Srivastava,None,India,Jane,Peacock

In [27]:
# 4. Obtén cada artículo de la factura con el nombre de la canción
query = '''
SELECT  ii.trackid, ii.invoiceid, t.name
from invoice_items as ii
LEFT JOIN tracks as t
on ii.trackid = t.trackid

'''

sql_query(query)

      TrackId  InvoiceId                                               Name
0           2          1                                  Balls to the Wall
1           4          1                                  Restless and Wild
2           6          2                              Put The Finger On You
3           8          2                                   Inject The Venom
4          10          2                                         Evil Walks
...       ...        ...                                                ...
2235     3136        411                                   Looking For Love
2236     3145        411                                    Sweet Lady Luck
2237     3154        411  Feirinha da Pavuna/Luz do Repente/Bagaço da La...
2238     3163        411                                   Samba pras moças
2239     3177        412                                           Hot Girl

[2240 rows x 3 columns]

In [34]:
# 5. Muestra todas las canciones con su nombre, formato, álbum y género
query = '''
SELECT  t.name, mt.name, a.title, g.name
from tracks as t 
LEFT JOIN albums as a
on t.albumid = a.albumid
LEFT JOIN genres as g
on t.genreid = g.genreid
LEFT JOIN media_types as mt
on t.mediatypeid = mt.mediatypeid
'''

sql_query(query)

,Name,Name,Title,Name
0,For Those About To Rock (We Salute You),MPEG audio file,For Those About To Rock We Salute You,Rock
1,Balls to the Wall,Protected AAC audio file,Balls to the Wall,Rock
2,Fast As a Shark,Protected AAC audio file,Restless and Wild,Rock
3,Restless and Wild,Protected AAC audio file,Restless and Wild,Rock
4,Princess of the Dawn,Protected AAC audio file,Restless and Wild,Rock
...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,Protected AAC audio file,Respighi:Pines of Rome,Classical
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",Protected AAC audio file,Schubert: The Late String Quartets & String Qu...,Classical
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",Protected AAC audio file,Monteverdi: L'Orfeo,Classical
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",Protected AAC audio file,Mozart: Chamber Music,Classical
3502,Koyaanisqatsi,Protected AAC audio file,Koyaanisqatsi (Soundtrack from the Motion Pict...,Soundtrack

In [37]:
# 6. Cuántas canciones hay en cada playlist
query = '''
SELECT p.name, p.playlistid, count(pt.trackid) as count_track
from playlists as p
LEFT JOIN playlist_track as pt
on p.playlistid = pt.playlistid
group by p.playlistid

'''

sql_query(query)

                          Name  PlaylistId  count_track
0                        Music           1         3290
1                       Movies           2            0
2                     TV Shows           3          213
3                   Audiobooks           4            0
4                   90’s Music           5         1477
5                   Audiobooks           6            0
6                       Movies           7            0
7                        Music           8         3290
8                 Music Videos           9            1
9                     TV Shows          10          213
10             Brazilian Music          11           39
11                   Classical          12           75
12   Classical 101 - Deep Cuts          13           25
13  Classical 101 - Next Steps          14           25
14  Classical 101 - The Basics          15           25
15                      Grunge          16           15
16         Heavy Metal Classic          17           26
17                 On-The-Go 1          18            1

In [43]:
# 7. Cuánto ha vendido cada empleado

query = '''
SELECT e.lastname, count(ii.trackid) as total_item
from customers as c
LEFT JOIN employees as e
on c.supportrepid = e.employeeid
LEFT JOIN invoices as i
on c.customerid = i.customerid
LEFT JOIN invoice_items as ii
on ii.invoiceid = i.invoiceid

'''

sql_query(query)

  LastName  total_item
0  Peacock        2240

In [42]:
# 7. Cuánto ha vendido cada empleado

query = '''
SELECT e.lastname, count(ii.trackid) as total_item, sum(i.total) as TOTAL
from customers as c
LEFT JOIN employees as e
on c.supportrepid = e.employeeid
LEFT JOIN invoices as i
on c.customerid = i.customerid
LEFT JOIN invoice_items as ii
on ii.invoiceid = i.invoiceid
GROUP BY e.firstname
'''

sql_query(query)

  LastName  total_item    TOTAL
0  Peacock         796  7427.06
1     Park         760  6931.40
2  Johnson         684  6490.16

In [41]:
# 7. Cuánto ha vendido cada empleado

query = '''
SELECT e.lastname, sum(i.total) as TOTAL
from customers as c
LEFT JOIN employees as e
on c.supportrepid = e.employeeid
LEFT JOIN invoices as i
on c.customerid = i.customerid
GROUP BY e.firstname
'''

sql_query(query)

  LastName   TOTAL
0  Peacock  833.04
1     Park  775.40
2  Johnson  720.16

In [31]:
query = '''
SELECT  *
from playlists
'''

sql_query(query)

    PlaylistId                        Name
0            1                       Music
1            2                      Movies
2            3                    TV Shows
3            4                  Audiobooks
4            5                  90’s Music
5            6                  Audiobooks
6            7                      Movies
7            8                       Music
8            9                Music Videos
9           10                    TV Shows
10          11             Brazilian Music
11          12                   Classical
12          13   Classical 101 - Deep Cuts
13          14  Classical 101 - Next Steps
14          15  Classical 101 - The Basics
15          16                      Grunge
16          17         Heavy Metal Classic
17          18                 On-The-Go 1

In [46]:
# 8. ¿Quién ha sido el agente de ventas que más ha vendido en 2009?

query = '''
SELECT e.lastname, count(ii.trackid) as total_item, sum(ii.unitprice) as TOTAL
from customers as c
LEFT JOIN employees as e
on c.supportrepid = e.employeeid
LEFT JOIN invoices as i
on c.customerid = i.customerid
LEFT JOIN invoice_items as ii
on ii.invoiceid = i.invoiceid
WHERE strftime('%Y', invoicedate) = '2009'
GROUP BY e.firstname
order by total desc
limit 1
'''

sql_query(query)

  LastName  total_item   TOTAL
0  Johnson         166  164.34

In [ ]:
# 9. ¿Cuáles son los 3 grupos que más han vendido?

query = '''
SELECT a.name,sum(ii.unitprice*ii.quantity) as total
from artists as a
LEFT JOIN albums as al
on a.artistid = al.artist3id
LEFT JOIN tracks as t
on t.albumid = t.albumid
LEFT JOIN invoice_items as ii
on ii.trackid = t.trackid
LEFT JOIN invoices as i
on i.invoiceid = ii.invoiceid
GROUP BY a.name
ORDER BY total desc
limit 3
'''

sql_query(query)

           Name    total
0   Iron Maiden  48900.6
1  Led Zeppelin  32600.4
2   Deep Purple  25614.6